{
    "en": {
        "title": "Welcome",
        "cover-welcome": "Welcome to my website!",
        "cover-caption": "Ruins of the Oujon Carthusian Monastery. Picture taken on Wednesday June 1st 2022.",
        "projects-title": "Projects",
        "photcol-title": "Photos collection",
        "photcol-text": "An album of pictures that is more complete than what I post on Instagram. Do not load this page if you have a limited amount of data.",
        "photcol-btn": "Access",
        "local-title": "Local",
        "local-text": "Points of interest, information about local history, useful resources, and more are available here.",
        "local-btn": "Access",
        "legal-title": "Legal",
        "legal-text": "Contains pages directly linked my law career. Useful legal resources too.",
        "legal-btn": "Access",
        "other-title": "Other projects",
        "other-text": "Contains most notably the library, all the pantheons, and any other public project I’ve shared on this website.",
        "other-btn": "Access",
        "about-title": "About",
        "version": "The website is currently in its <b>Twelfth Version</b>. The contents of this website were last modified on <b>Tuesday June 17th 2025</b>. For more information, consult the change log below:",
        "change-log": "View the Change Log",
        "about-me": "About me",
        "about-me-p1": "First of all I want to thank you for checking this website out. It really means a lot. I'm Max, I'm a 20 year old law student in Switzerland. I was born here and I haven't moved much at all. I'm part-French and part-Russian. I speak English, French, and Russian fluently, and I've had the chance to learn German at school. The very limited translation work you see on this website is a way to keep my mind fresh.",
        "about-me-p2": "I don't have a background in tech. Instead, I mainly sticking to legal codes and court rulings, but I do like to occasionally dabble in little projects and undertakings. Some programming here, some more hands-on work there, some more creative stuff too. I learned the very basics of HTML when I was around the age of 11, and then took a coding course when I was about to turn 15. What you see is the fruit of the little bits of knowledge I have left.",
        "about-me-p3": "I'm currently entering my third year of law school for my bachelor's degree at the University of Geneva. I get to work as a substitute town councillor in my village, and also as a legal advisor to student associations. In my free time I enjoy running and hiking, and I think it's safe to say that this area is filled with beautiful sights, interesting things to discover, and a rich local history. I also go on bike rides and hit the gym. Feel free to <a href='https://strava.app.link/aiCBwaqofUb' target='_blank'>add me on Strava</a> :)",
        "caption-picofme": "I'm literally him.",
        "history-title": "Website History",
        "history-p1": "This website was created to host all projects together in a way that is accessible to myself and my friends. The map of all local curiosities used to be its own link that I'd have to copy paste into DMs if I wanted to share it with someone. Creating a website would make things a lot more practical. So I started coding. It took a while to sort everything out, from what hosting platform I should use to what I wanted the website to look like. Programming the website seemed like the best option as it would allow me to practice what I learned, it gave me more control over how the site looked like, and it was also an opportunity to flex.",
        "history-p2": "I undertook the project in early September 2020. The first version of the site was launched on Thursday August 12th 2021. There's been a fair bit of changes since. The site has become more sophisticated, hosting more than just the map and exploring stuff. Some projects and features have been added, some have been abandoned, and others have been decommissionned to come back in the future, and others have been extensively modified. This site doesn't evolve as much as I'd like it to though because of my other commitments. If you really want to see changes, tune into the holiday periods.",
        "history-p3": "It's really a pleasure to be able to keep this website up. Any feedback or suggestions are always welcome! Feel free to contact me through the various links you may find. Enjoy the site.",
        "thanks-title": "Acknowledgements and credits",
        "thanks-p1": "<a href='https://pages.github.com/' target='blank'>GitHub Pages</a> allows me to host this static website for free. <a href='https://getbootstrap.com/' target='blank'>Bootstrap</a> has provided documentation which really simplified my work. <a href='https://fontawesome.com/' target='blank'>Fontawesome</a> provides useful icons that make my website look better (the navbar wouldn't have been what it is without this website). <a href='https://favicomatic.com/' target='blank'>Favic-O-Matic</a> has created the little icons at the top of the tab. Various coding software was used to create this website, mainly <a href='https://brackets.io/' target='blank'>Brackets</a>, <a href='https://phcode.dev/' target='blank'>PhoenixCode</a>, and <a href='https://code.visualstudio.com/' target='blank'>Visual Studio Code</a>. <a href='https://openai.com/chatgpt/' target='blank'>ChatGPT</a> has also helped me in some fields, mainly with writing JavaScript.",
        "thanks-p2": "It goes without saying that I also thank everyone who has helped me directly or indirectly with this website: my Digital Design and Development teacher from Years 10-11, my tech-savvy freinds, and everyone online who provided useful answers. Thank you to all those who keep similar blogs which inspired me to undertake this adventure. I can cite my friends who embark on their creative projects, and the great <a href='https://www.visinand.ch' target='_blank'>Alain Visinand</a>, amongst many others.",
        "footer-p1": "Website hosted thanks to Github Pages. Please reach out with the email link in the navbar if you have any questions. Enjoy the website.",
        "footer-p2": "The access to the repository is available <a href='https://github.com/MaxanceProjects/maxanceprojects.github.io' target='_blank'>here</a>."
    },
    "fr": {
        "title": "Bienvenue",
        "cover-welcome": "Bienvenue sur mon site!",
        "cover-caption": "Ruines de la Chartreuse Notre Dame d'Oujon. Photo prise le mercredi 1er juin 2022.",
        "projects-title": "Projets",
        "photcol-title": "Photos",
        "photcol-text": "Un album de photos qui est plus complet que ce que je publie sur Instagram. Ne faites pas charger cette page si vous avez peu de données mobiles.",
        "photcol-btn": "Accéder",
        "local-title": "Local",
        "local-text": "Points d'intérêt, informations historiques locales et ressources utiles sont disponibles ici.",
        "local-btn": "Accéder",
        "legal-title": "Juridique",
        "legal-text": "Contient des pages et ressources directement liées à mon travail juridique.",
        "legal-btn": "Accéder",
        "other-title": "Autres projets",
        "other-text": "Contient tout autre projet publique que j'ai partagé sur ce site.",
        "other-btn": "Accéder",
        "about-title": "À propos",
        "version": "Ce site est actuellement dans sa <b>trèzième version</b>. Le contenu de ce site a été modifié le <b>mardi 17 juin 2025</b>. Pour plus d'informations, veuillez consulter l'historique des modifications.",
        "change-log": "Voir l'historique des modifications (EN)",
        "about-me": "Moi",
        "about-me-p1": "Je voudrais d'abord vous remercier pour la visite de ce site. Je suis Max, j'ai 20 ans. J'étudie le droit en Suisse. Je suis né ici et je n'ai pas énormément bougé dans ma vie. Je suis franco-russe. Je parle le Français, l'Anglais et le Russe couramment et j'ai eu la possibilité d'apprendre l'Allemand à l'école. Les quelques traductions que vous voyez sont un moyen de garder mon esprit stimulé.",
        "about-me-p2": "Je n'ai pas de grande formation en technologie. Je me contente de me plonger dans mes lois et décisions jurisprudentielles, mais j'aime de temps en temps expérimenter avec des petits projets et travaux. Un peu de programmation par ici, des travaux manuels par là, ou quelque chose de créatif. J'ai appris les bases de l'HTML quand j'avais 11 ans et j'ai vraiment développé mes connaissances pendant mon cours d'informatique quand j'allais avoir 15 ans. Ce que vous voyez est le fruit des petits vestiges de connaissances qui me restent.",
        "about-me-p3": "J'entre actuellement ma troisième année de bachelor en droit à l'Université de Genève. Je travaille en tant que conseiller communal suppléant dans ma commune, ainsi que conseiller juridique auprès d'associations étudiantes. Dans mon temps libre j'aime surtout aller courir et faire des randonnées, surtout que la région est ornée de beaux paysages et de choses intéressantes à découvrir, mais aussi d'une riche histoire locale. J'aime aussi faire du vélo et aller à la salle de sport. Soyez les bienvenus pour <a href='https://strava.app.link/aiCBwaqofUb' target='_blank'>m'ajouter sur Strava</a> :)",
        "caption-picofme": "Je suis littéralement lui.",
        "history-title": "Histoire du site",
        "history-p1": "Ce site a été crée pour héberger tous mes projets d'une façon accessible à moi et mes amis. Par exemple, la carte de toutes les curiosités locales avaient leur propre lien que je devais envoyer à chaque fois si je voulais le partager avec quelqu'un. Créer un site rendrait les choses plus pratiques. Donc j'ai commencé à programmer. Ça a pris pas mal de temps pour tout mettre en place, notamment pour déterminer quelle plateforme allait héberger le site et l'apparence du site. L'idée de programmer le site à partir de rien semblait être la meilleure option pour moi, car je voulais pratiquer ce que j'avais appris, ce procédé me laissait plus de contrôle et c'est aussi une bonne opportunité de flex.",
        "history-p2": "Le projet a commencé au début du mois de septembre 2020. La première version du site a été déployée le jeudi 12 août 2021. Un grand nombre de changements sont venus avec le temps. Le site est devenu plus sophistiqué et héberge nettement plus que ce qui est lié au patrimoine local. Certains projets et fonctionnalités ont été ajoutés, d'autres ont été abandonnés, d'autres ont été retirés pour revenir plus tard, d'autres encore ont été modifiés de manière significative. Le site n'évolue pas aussi vite que souhaité à cause d'autres travaux et projets qui ont besoin de moi. Si vous voulez réellement voir des changements, surveillez ce site pendant les périodes de vacances.",
        "history-p3": "C'est vraiment un plaisir de pouvoir maintenir ce site. Tout retour ou suggestion sont les bienvenues! Vous êtes les bienvenus à me contacter à travers les divers liens que vous trouverez.",
        "thanks-title": "Remerciements",
        "thanks-p1": "<a href='https://pages.github.com/' target='blank'>GitHub Pages</a> me permet de publier ce site gratuitement. <a href='https://getbootstrap.com/' target='blank'>Bootstrap</a> a fourni de la documentation qui a vraiment simplifié mon travail. <a href='https://fontawesome.com/' target='blank'> Fontawesome </a> fournit des icônes utiles qui améliorent l'apparence de mon site (le menu de navigation serait très différent sans cet outil). <a href='https://favicomatic.com/' target='blank'>Favic-O-Matic</a> a créé les petits icônes en haut de l'onglet. Divers logiciels de programmation ont été utilisés pour créer ce site, principalement  <a href='https://brackets.io/' target='blank'>Brackets</a>, <a href='https://phcode.dev/' target='blank'>PhoenixCode</a>, et <a href='https://code.visualstudio.com/' target='blank'>Visual Studio Code</a>. <a href='https://openai.com/chatgpt/' target='blank'>ChatGPT</a> m'a aussi aidé à certains moments, notamment pour le JavaScript.",
        "thanks-p2": "Je voudrais bien-sûr remercier tous ceux qui m'ont aidé directement ou indirectement avec ce site: ma professeure d'informatique, mes amis experts en technologie et tous ceux qui ont fournis des réponses utiles. Merci à tous ceux qui tiennent des projets ou blogs similaires qui m'ont inspiré d'entreprendre cette aventure. Je peux citer mes amis qui ont leurs projets, mais aussi le grand <a href='https://www.visinand.ch' target='_blank'>Alain Visinand</a>, parmi tant d'autres.",
        "footer-p1": "Ce site est en ligne grâce à GitHub pages. Contactez moi avec le lien vers mon courriel dans le menu de navigation si vous avez des questions.",
        "footer-p2": "L'accès au dépôt est disponible <a href='https://github.com/MaxanceProjects/maxanceprojects.github.io' target='_blank'>ici</a>."
    },
    "ru": {
        "title": "",
        "cover-welcome": "",
        "cover-caption": "",
        "projects-title": "",
        "photcol-title": "",
        "photcol-text": "",
        "photcol-btn": "",
        "local-title": "",
        "local-text": "",
        "local-btn": "",
        "legal-title": "",
        "legal-text": "",
        "legal-btn": "",
        "other-title": "",
        "other-text": "",
        "other-btn": "",
        "about-title": "",
        "version": "",
        "change-log": "",
        "about-me": "",
        "about-me-p1": "",
        "about-me-p2": "",
        "about-me-p3": "",
        "caption-picofme": "",
        "history-title": "",
        "history-p1": "",
        "history-p2": "",
        "history-p3": "",
        "thanks-title": "",
        "thanks-p1": "",
        "thanks-p2": "",
        "footer-p1": "",
        "footer-p2": ""
    },
    "de": {
        "title": "",
        "cover-welcome": "",
        "cover-caption": "",
        "projects-title": "",
        "photcol-title": "",
        "photcol-text": "",
        "photcol-btn": "",
        "local-title": "",
        "local-text": "",
        "local-btn": "",
        "legal-title": "",
        "legal-text": "",
        "legal-btn": "",
        "other-title": "",
        "other-text": "",
        "other-btn": "",
        "about-title": "",
        "version": "",
        "change-log": "",
        "about-me": "",
        "about-me-p1": "",
        "about-me-p2": "",
        "about-me-p3": "",
        "caption-picofme": "",
        "history-title": "",
        "history-p1": "",
        "history-p2": "",
        "history-p3": "",
        "thanks-title": "",
        "thanks-p1": "",
        "thanks-p2": "",
        "footer-p1": "",
        "footer-p2": ""
    }
}
