{
    "en": {
        "title": "The World.",
        "world-title": "The World.",
        "introduction": "On larger screens, you can navigate the map through a window on this website. For smaller screens, click on the button below and open it in either Google Maps or Google Earth. You can see a set of points on your left. Each point is numbered and has a specific icon. You can search for these points in the search bar or look for other locations. When clicking on a point, you can see its number, name, any pictures that go with it, a description, coordinates, and useful links if you'd like to know more. <span style='color: darkred; font-weight: bold;'>Before you do anything else, consult the sections below this map. They contain crucial information, as well as a key to decode the map if you are still confused.</span>",
        "world-btn": "See the map",
        "info-title": "Important information and disclaimers",
        "info-p1": "Before anything, I understand that this map can be abused. Please do your research. I am no caving or mountaineering expert, nor do I know which properties are fatal upon trespassing, I'm just a 20 year old guy who likes to go outside. Please don't put yourself in danger, inform yourself of everything that you may need before you set off, make sure to not tresspass, bring proper equipment, contact people you trust, pack everything you need, and do anything else required of you based on the situation. Be diligent! Be careful! Be smart! Be anything else the circumstances ask for! I am not responsible for your mistakes, and I really cannot stress this enough. I'm not your tour guide, we're not in any kind of relation of trust here. Just because the points that exist here can theoretically be done by me and/or some capable friends I know, doesn't mean that they can be done by you. Thank you for your understanding!I fully admit that I'm <a href='https://www.fedlex.admin.ch/eli/cc/27/317_321_377/en#art_100' target='_blank'>excluding my liability</a> for anything other than unlawful intent (which there isn't, I want the best for all of you ♥), nor is there any gross negligence, I clearly told you all to be careful, and that you accept this by using the map!",
        "info-p2": "Now that this is done with, I can say that this project is one that I'm incredibly proud of. The map was created on July 27th 2019 and has been updated and revamped many times since, but it is still that same original file you consult.",
        "info-p3": "I try to make the map as precise as I can with all resources I find online and on-site. Mistakes can happen though: locations can be closed, destroyed, forgotten, or never even there in the first place. The conclusions I draw may be inaccurate. Please, if you become aware of any kind of error or want to drop a suggestion, please contact me, either digitally or talk to me in person. I'll really appreciate it.",
        "info-p4": "I also suggest you double check everything as close to your trip as possible, as the map does get updated from time to time. We currently sit at 3'000+ views, and a lot of that is me tweaking the map.",
        "info-p5": "Although this map is technically public, I'd appreciate if the map can still keep a low profile. Don't throw this map around to everyone. This is mostly for myself and friends. There's a reason you can't access this through a Google Search.",
        "info-p6": "All maps and sources I use are in the <a href='sources.html'>resources and sources section</a>.",
        "decrypt-title": "Decoding the map",
        "layer1-text": "<b>Layer 1</b>: collection of all points of interest. It is the official collection of all interesting spots. Each place has an official number. Places that are very close to one another may be grouped under one number but distinguished by a, b, c, etc. Although all places are dots, they are colored differently based on what they represent. The table below can help you understand everything better.",
        "icon-header": "Icon",
        "description-header": "Description",
        "general": "A general point that doesn't fit any of the special categories below.",
        "prehistoric": "A prehistoric site.",
        "antiquity": "A site from the antiquity but that is not roman (Celtic for example).",
        "roman": "A roman site.",
        "medieval": "A medieval site, from the end of roman rule on the region to the modern times.",
        "modern-contemporary": "Anything from the last couple centuries.",
        "cave": "A cave (difficulty not mentioned, be careful).",
        "water": "A point of water. It could be a spring, a fountain, etc."
    },
    "fr": {
        "title": "Le Monde.",
        "world-title": "Le Monde.",
        "introduction": "Vous pouvez utiliser la carte à travers une fenêtre intégrée dans le site sur des écrans plus larges. Pour les écrans plus petits, veuillez cliquer sur le bouton ci-dessous et ouvrir la carte dans Google Maps ou Google Earth. Vous verrez une liste d'endroits à gauche. Chaque point est numéroté et a un symbole spécifique. Vous pouvez rechercher ces points ou d'autres endroits dans la barre de recherche. Quand vous sélectionnez un point, vous pourrez voir son numéro, nom, les photos qui viennent avec, une description, des coordonnées et tout lien utile qui pourrait vous donner l'opportunité d'en savoir plus. <span style='color: darkred; font-weight: bold;'>Avant que vous faisiez quoi que ce soit, consultez les informations sous cette carte. Elles contiennent des informations cruciales, ainsi qu'un guide pour décrypter la carte si vous êtes toujours confus.</span>",
        "world-btn": "Voir la carte",
        "info-title": "Informations importantes et exclusion de responsabilité",
        "info-p1": "Avant tout, je comprends que cette carte peut être absuée. Effectuez vos recherches, s'il vous plaît. Je ne suis ni spéléologue ni guide de montagne, et je ne suis pas un registre foncier sur jambes qui pourrait savoir chez qui il serait fatal d'entrer, je suis juste un gars de 20 ans qui aime sortir. Ne vous mettez pas en danger, informez vous de tout ce qui vous est nécessaire avant votre départ, faites attention à ne pas être auteur d'une violation de domicile, apportez l'équipement approprié, contactez des personnes de confiance, emportez tout ce dont vous avez besoin avec vous, et faites toute autre chose exigée de vous selon la situation. Soyez diligents ! Soyez attentionnés ! Soyez intelligents! Soyez tout ce dont les circonstances commandent de votre part ! Je ne suis pas responsable de vos erreurs, et je ne peux pas le souligner assez. Je ne suis pas un guide touristique, nous ne sommes pas dans une relation fondée sur la confiance non-plus. Juste parce que les points qui existent ici peuvent théoriquement être visités par moi et des amis capables que je connais personnellement, cela ne veut pas dire que ces points peuvent être atteints par vous. Merci de votre compréhension! J'admets totalement que <a href='https://www.fedlex.admin.ch/eli/cc/27/317_321_377/fr#art_100' target='_blank'>j'exclus ma responsabilité</a> pour tout ce qui n'est pas du dol, faute intentionnelle grave (dont il n'y a pas, je veux le meilleur pour vous tous ♥), ni quelconque négligence grossière, je vous ai clairement dit de faire attention, et que vous acceptez ceci en utilisant la carte!",
        "info-p2": "Maintenant que j'en ai fini avec le juridique, je peux dire que je suis très fier de ce projet. La carte a été crée le 27 juillet 2019 et a été mise à jour et refaite de nombreuses fois depuis, malgré le fait que c'est toujours le même fichier d'origine qui est resté consultable au fil des années.",
        "info-p3": "J'essaie de rendre cette carte aussi précise et correcte que possible. Des erreurs peuvent survenir: certains endroits peuvent être fermés, détruits, oubliés ou inexistants. Les conclusions que je tire de mes recherches et visites peuvent aussi être erronées. Je vous demande, en cas d'erreur ou suggestion de toute sorte, de me contacter, soit en ligne ou en personne. Je vous serais très reconnaissant.",
        "info-p4": "Je vous suggère aussi de tout vérifier avant votre voyage, puisque la carte se met à jour de temps en temps. Nous sommes actuellement à plus de 3'000 vues et beaucoup d'entre elles proviennent de mes modifications et vérifications.",
        "info-p5": "Même si la carte est techniquement publique, je vous serais reconnaissant si la carte peut quand-même tenir profil bas. Ne balancez pas cette carte à tout le monde. Ce projet est principalement pour moi et des amis et il y a une raison pour laquelle cette page est inaccessible via une rechercher Google.",
        "info-p6": "Toutes les cartes et sources que j'utilise sont disponibles dans <a href='sources.html'>la partie resources and sources</a>.",
        "decrypt-title": "Décrypter la carte",
        "layer1-text": "Couche 1: collection de tous les points d'intérêt. C'est la collection officielle de tous les points intéressants. Chaque endroit a un numéro officiel. Les lieux proches l'un de l'autres peuvent être regroupés sous un nombre mais distingués par des lettres. Même si chaque endroit est un point, ils sont colorés différemment selon ce qu'ils représentent. Le tableau ci-dessous peut vous aider à mieux comprendre.",
        "icon-header": "Symbole",
        "description-header": "Description",
        "general": "Un point général qui ne rentre pas dans l'une des catégories spéciales qui suivent.",
        "prehistoric": "Un site préhistorique",
        "antiquity": "Un site de l'antiquité qui n'est pas romain (Celte par exemple).",
        "roman": "Un site romain.",
        "medieval": "Un site médiéval, entre la fin de l'emprise romaine sur la région jusqu'aux temps modernes.",
        "modern-contemporary": "Un site des derniers siècles.",
        "cave": "Une grotte, gouffre, baume, etc. (difficultés non-mentionnée, soyez prudents).",
        "water": "Un point lié à l'eau. Une source, une fontaine, etc."
    },
    "ru": {
        "title": "",
        "world-title": "",
        "introduction": "",
        "world-btn": "",
        "info-title": "",
        "info-p1": "",
        "info-p2": "",
        "info-p3": "",
        "info-p4": "",
        "info-p5": "",
        "info-p6": "",
        "decrypt-title": "",
        "layer1-text": "",
        "icon-header": "",
        "description-header": "",
        "general": "",
        "prehistoric": "",
        "antiquity": "",
        "roman": "",
        "medieval": "",
        "modern-contemporary": "",
        "cave": "",
        "water": ""
    },
    "de": {
        "title": "",
        "world-title": "",
        "introduction": "",
        "world-btn": "",
        "info-title": "",
        "info-p1": "",
        "info-p2": "",
        "info-p3": "",
        "info-p4": "",
        "info-p5": "",
        "info-p6": "",
        "decrypt-title": "",
        "layer1-text": "",
        "icon-header": "",
        "description-header": "",
        "general": "",
        "prehistoric": "",
        "antiquity": "",
        "roman": "",
        "medieval": "",
        "modern-contemporary": "",
        "cave": "",
        "water": ""
    }
}
